In [1]:
from dotenv import load_dotenv
import pandas
import os
import psycopg2 as ps
import pandas as pd
import sqlalchemy

pd.set_option('display.max_columns', None)
load_dotenv()

# print DB_HOST
print(os.environ["DB_HOST"])
print(os.environ["DB_NAME"])
conn = ps.connect(
    host=os.environ["DB_HOST"],
    port=os.environ["DB_PORT"],
    dbname=os.environ["DB_NAME"],
    user=os.environ["DB_USER"],
    # password=os.environ["DB_PASS"]
    )


def sql(query):
    return pandas.read_sql(query, conn)


print(" successfully connected")


sqlalchemy.create_engine("postgresql://luis:@localhost:5432/postgres")

%load_ext sql
%sql postgresql://luis:@localhost:5432/postgres

print(" inline sql successfully connected")

localhost
postgres
 successfully connected
 inline sql successfully connected

In [2]:
%%sql
-- Missing data in SQL#
SELECT 
  COUNT(*) AS count_rows,
  COUNT(value) AS count_values
FROM (VALUES 
  (1),
  (null)
) AS t(value);

*  postgresql://luis:***@localhost:5432/postgres
1 rows affected.

[(2, 1)]

In [3]:
%%sql
-- We can't use the equality comparison operator, =, to check if a certain value is NULL. To check if a value is NULL, we need to use the IS operator instead:


SELECT 
  NULL = NULL  AS equal,
  NULL IS NULL AS is
;

*  postgresql://luis:***@localhost:5432/postgres
1 rows affected.

[(None, True)]

In [5]:
%%sql
-- Comparing nullable values and columns can be tricky. If we use the equality operator we may get NULL as a result. To safely compare NULL values for equality, SQL offers the IS DISTINCT FROM operator:


SELECT
  a,
  b,
  a = b as equal,
  a IS DISTINCT FROM b AS is_distinct_from,
  a IS NOT DISTINCT FROM b AS is_NOT_distinct_from
FROM (VALUES 
  (1, 1),
  (1, 2),
  (1, NULL),
  (NULL, NULL)
) AS t(a, b);

*  postgresql://luis:***@localhost:5432/postgres
4 rows affected.

[(1, 1, True, False, True),
 (1, 2, False, True, False),
 (1, None, None, True, False),
 (None, None, None, False, True)]

In [7]:
%%sql
--- Back Filling and Forward Filling
-- Filling constant values#

SELECT 
  n,
  v,
  CASE WHEN v IS NULL THEN 'X' ELSE v END AS adjusted_value
FROM (VALUES
  (1, 'A' ),
  (2, 'B' ),
  (3, null),
  (4, 'D' ),
  (5, null),
  (6, null),
  (7, 'G' )
) AS t(n, v);

*  postgresql://luis:***@localhost:5432/postgres
7 rows affected.

[(1, 'A', 'A'),
 (2, 'B', 'B'),
 (3, None, 'X'),
 (4, 'D', 'D'),
 (5, None, 'X'),
 (6, None, 'X'),
 (7, 'G', 'G')]

In [8]:
%%sql
SELECT 
  n,
  v,
  COALESCE(v, 'X') AS adjusted_value
FROM (VALUES
  (1, 'A' ),
  (2, 'B' ),
  (3, null),
  (4, 'D' ),
  (5, null),
  (6, null),
  (7, 'G' )
) AS t(n, v);

*  postgresql://luis:***@localhost:5432/postgres
7 rows affected.

[(1, 'A', 'A'),
 (2, 'B', 'B'),
 (3, None, 'X'),
 (4, 'D', 'D'),
 (5, None, 'X'),
 (6, None, 'X'),
 (7, 'G', 'G')]

In [9]:
%%sql
-- Back filling#
-- For example, let's say we have a time series of temperatures with days and the temperature each day. In some of the rows, the temperature is missing, and we want to fill it with the last known temperature:


SELECT 
  t, 
  c,
  COALESCE(c, LAG(c) OVER (ORDER BY t)) AS adjusted_c 
FROM (VALUES
  ('2021-01-01'::date, 10),
  ('2021-01-02'::date, 12),
  ('2021-01-03'::date, null),
  ('2021-01-04'::date, 14),
  ('2021-01-05'::date, null),
  ('2021-01-06'::date, null),
  ('2021-01-07'::date, 18),
  ('2021-01-08'::date, 15)
) as t(t, c);

*  postgresql://luis:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2021, 1, 1), 10, 10),
 (datetime.date(2021, 1, 2), 12, 12),
 (datetime.date(2021, 1, 3), None, 12),
 (datetime.date(2021, 1, 4), 14, 14),
 (datetime.date(2021, 1, 5), None, 14),
 (datetime.date(2021, 1, 6), None, None),
 (datetime.date(2021, 1, 7), 18, 18),
 (datetime.date(2021, 1, 8), 15, 15)]

In [10]:
%%sql
-- Given that our time series can have more than one consecutive missing value, we can't use LAG. Instead, we can use a subquery:


WITH t AS (
  SELECT * 
  FROM (VALUES
    ('2021-01-01'::date, 10),
    ('2021-01-02'::date, 12),
    ('2021-01-03'::date, null),
    ('2021-01-04'::date, 14),
    ('2021-01-05'::date, null),
    ('2021-01-06'::date, null),
    ('2021-01-07'::date, 18),
    ('2021-01-08'::date, 15)
  ) as t(t, c)
)
SELECT 
  t, 
  c,
  COALESCE(c, (
    SELECT c
    FROM t as t_inner
    WHERE t_inner.t < t_outer.t
    AND t_inner.c IS NOT NULL
    ORDER BY t_inner.t DESC
    LIMIT 1
  )) AS adjusted_c 
FROM 
  t AS t_outer;

*  postgresql://luis:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2021, 1, 1), 10, 10),
 (datetime.date(2021, 1, 2), 12, 12),
 (datetime.date(2021, 1, 3), None, 12),
 (datetime.date(2021, 1, 4), 14, 14),
 (datetime.date(2021, 1, 5), None, 14),
 (datetime.date(2021, 1, 6), None, 14),
 (datetime.date(2021, 1, 7), 18, 18),
 (datetime.date(2021, 1, 8), 15, 15)]

In [11]:
%%sql
-- Forward fill#
WITH t AS (
  SELECT * 
  FROM (VALUES
    ('2021-01-01'::date, 10),
    ('2021-01-02'::date, 12),
    ('2021-01-03'::date, null),
    ('2021-01-04'::date, 14),
    ('2021-01-05'::date, null),
    ('2021-01-06'::date, null),
    ('2021-01-07'::date, 18),
    ('2021-01-08'::date, 15)
  ) as t(t, c)
)
SELECT 
  t, 
  c,
  COALESCE(c, (
    SELECT c
    FROM t as t_inner
    WHERE t_inner.t > t_outer.t
    AND t_inner.c IS NOT NULL
    ORDER BY t_inner.t ASC
    LIMIT 1
  )) AS adjusted_c 
FROM 
  t AS t_outer;

*  postgresql://luis:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2021, 1, 1), 10, 10),
 (datetime.date(2021, 1, 2), 12, 12),
 (datetime.date(2021, 1, 3), None, 14),
 (datetime.date(2021, 1, 4), 14, 14),
 (datetime.date(2021, 1, 5), None, 18),
 (datetime.date(2021, 1, 6), None, 18),
 (datetime.date(2021, 1, 7), 18, 18),
 (datetime.date(2021, 1, 8), 15, 15)]

In [12]:
%%sql
-- Linear interpolation formula#
-- y = y0 + (x - x0) * ((y1 - y0) / (x1 - x0))

select * from temperatures

*  postgresql://luis:***@localhost:5432/postgres
16 rows affected.

[(datetime.date(2021, 1, 1), 'NY', 10),
 (datetime.date(2021, 1, 2), 'NY', 12),
 (datetime.date(2021, 1, 3), 'NY', 13),
 (datetime.date(2021, 1, 4), 'NY', 14),
 (datetime.date(2021, 1, 5), 'NY', 18),
 (datetime.date(2021, 1, 6), 'NY', 15),
 (datetime.date(2021, 1, 7), 'NY', 16),
 (datetime.date(2021, 1, 8), 'NY', 17),
 (datetime.date(2021, 1, 1), 'LA', 22),
 (datetime.date(2021, 1, 2), 'LA', 21),
 (datetime.date(2021, 1, 3), 'LA', 19),
 (datetime.date(2021, 1, 4), 'LA', 22),
 (datetime.date(2021, 1, 5), 'LA', 25),
 (datetime.date(2021, 1, 6), 'LA', 27),
 (datetime.date(2021, 1, 7), 'LA', 25),
 (datetime.date(2021, 1, 8), 'LA', 27)]

In [15]:
%%sql
drop table if exists temperatures_05;
CREATE TABLE temperatures_05 AS 
  SELECT * 
  FROM (VALUES
    ('2021-01-01'::date, 10),
    ('2021-01-02'::date, 12),
    ('2021-01-03'::date, null),
    ('2021-01-04'::date, 14),
    ('2021-01-05'::date, null),
    ('2021-01-06'::date, null),
    ('2021-01-07'::date, 18),
    ('2021-01-08'::date, 15)
  ) as t(t, c);

SELECT * FROM temperatures_05;

*  postgresql://luis:***@localhost:5432/postgres
Done.
8 rows affected.
8 rows affected.

[(datetime.date(2021, 1, 1), 10),
 (datetime.date(2021, 1, 2), 12),
 (datetime.date(2021, 1, 3), None),
 (datetime.date(2021, 1, 4), 14),
 (datetime.date(2021, 1, 5), None),
 (datetime.date(2021, 1, 6), None),
 (datetime.date(2021, 1, 7), 18),
 (datetime.date(2021, 1, 8), 15)]

In [16]:
%%sql
SELECT * FROM temperatures_05;

*  postgresql://luis:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2021, 1, 1), 10),
 (datetime.date(2021, 1, 2), 12),
 (datetime.date(2021, 1, 3), None),
 (datetime.date(2021, 1, 4), 14),
 (datetime.date(2021, 1, 5), None),
 (datetime.date(2021, 1, 6), None),
 (datetime.date(2021, 1, 7), 18),
 (datetime.date(2021, 1, 8), 15)]

In [17]:
%%sql
-- To calculate linear interpolation we first need to have the previous and the next known value for each missing row. Our data includes consecutive days with missing temperatures, so we'll use a subquery:


WITH temperatures_with_next_and_previous AS (
  SELECT 
    *,

    -- Last known temperature
    (
      SELECT c
      FROM temperatures_05 t_inner
      WHERE t_outer.t > t_inner.t
      AND t_inner.c IS NOT NULL
      ORDER BY t_inner.t DESC
      LIMIT 1
    ) AS last_known_temperature,

    -- Next known temperature
    (
      SELECT c
      FROM temperatures_05 t_inner
      WHERE t_outer.t < t_inner.t
      AND t_inner.c IS NOT NULL
      ORDER BY t_inner.t ASC
      LIMIT 1
    ) AS next_known_temperature

  FROM
    temperatures_05 as t_outer
)
SELECT 
  * 
FROM 
  temperatures_with_next_and_previous;

*  postgresql://luis:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2021, 1, 1), 10, None, 12),
 (datetime.date(2021, 1, 2), 12, 10, 14),
 (datetime.date(2021, 1, 3), None, 12, 14),
 (datetime.date(2021, 1, 4), 14, 12, 18),
 (datetime.date(2021, 1, 5), None, 14, 18),
 (datetime.date(2021, 1, 6), None, 14, 18),
 (datetime.date(2021, 1, 7), 18, 14, 15),
 (datetime.date(2021, 1, 8), 15, 18, None)]

In [21]:
%%sql
-- To return more than one value from the subqueries, we can use an array. However, an array cannot contain values of different types. To demonstrate, consider the following error when attempting to create an array with elements of different types.

-- SELECT ARRAY['2021-01-01'::date, 1]; // error 

WITH temperatures_with_next_and_previous AS (
  SELECT 
    *,

    -- Last known temperature
    (
      SELECT ARRAY[EXTRACT('epoch' FROM t), c]
      FROM temperatures_05 t_inner
      WHERE t_outer.t > t_inner.t
      AND t_inner.c IS NOT NULL
      ORDER BY t_inner.t DESC
      LIMIT 1
    ) AS last_known_temperature,

    -- Next known temperature
    (
      SELECT ARRAY[EXTRACT('epoch' FROM t), c]
      FROM temperatures_05 t_inner
      WHERE t_outer.t < t_inner.t
      AND t_inner.c IS NOT NULL
      ORDER BY t_inner.t ASC
      LIMIT 1
    ) AS next_known_temperature

  FROM
    temperatures_05 as t_outer
)
SELECT 
  * 
FROM 
  temperatures_with_next_and_previous;

*  postgresql://luis:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2021, 1, 1), 10, None, [Decimal('1609545600'), Decimal('12')]),
 (datetime.date(2021, 1, 2), 12, [Decimal('1609459200'), Decimal('10')], [Decimal('1609718400'), Decimal('14')]),
 (datetime.date(2021, 1, 3), None, [Decimal('1609545600'), Decimal('12')], [Decimal('1609718400'), Decimal('14')]),
 (datetime.date(2021, 1, 4), 14, [Decimal('1609545600'), Decimal('12')], [Decimal('1609977600'), Decimal('18')]),
 (datetime.date(2021, 1, 5), None, [Decimal('1609718400'), Decimal('14')], [Decimal('1609977600'), Decimal('18')]),
 (datetime.date(2021, 1, 6), None, [Decimal('1609718400'), Decimal('14')], [Decimal('1609977600'), Decimal('18')]),
 (datetime.date(2021, 1, 7), 18, [Decimal('1609718400'), Decimal('14')], [Decimal('1610064000'), Decimal('15')]),
 (datetime.date(2021, 1, 8), 15, [Decimal('1609977600'), Decimal('18')], None)]

In [23]:
%%sql
WITH temperatures_with_next_and_previous AS (
  SELECT 
    *,

    -- Last known temperature
    (
      SELECT ARRAY[EXTRACT('epoch' FROM t), c]
      FROM temperatures_05 t_inner
      WHERE t_outer.t > t_inner.t
      AND t_inner.c IS NOT NULL
      ORDER BY t_inner.t DESC
      LIMIT 1
    ) AS last_known_temperature,

    -- Next known temperature
    (
      SELECT ARRAY[EXTRACT('epoch' FROM t), c]
      FROM temperatures_05 t_inner
      WHERE t_outer.t < t_inner.t
      AND t_inner.c IS NOT NULL
      ORDER BY t_inner.t ASC
      LIMIT 1
    ) AS next_known_temperature

  FROM
    temperatures_05 as t_outer
),

temperatures_prep AS (
  SELECT
    t,
    c,
    extract('epoch' from t) as x,
    last_known_temperature[1] as x0,
    last_known_temperature[2] as y0,
    next_known_temperature[1] as x1,
    next_known_temperature[2] as y1
  FROM
    temperatures_with_next_and_previous
)

SELECT 
  * 
FROM 
  temperatures_prep;

*  postgresql://luis:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2021, 1, 1), 10, Decimal('1609459200'), None, None, Decimal('1609545600'), Decimal('12')),
 (datetime.date(2021, 1, 2), 12, Decimal('1609545600'), Decimal('1609459200'), Decimal('10'), Decimal('1609718400'), Decimal('14')),
 (datetime.date(2021, 1, 3), None, Decimal('1609632000'), Decimal('1609545600'), Decimal('12'), Decimal('1609718400'), Decimal('14')),
 (datetime.date(2021, 1, 4), 14, Decimal('1609718400'), Decimal('1609545600'), Decimal('12'), Decimal('1609977600'), Decimal('18')),
 (datetime.date(2021, 1, 5), None, Decimal('1609804800'), Decimal('1609718400'), Decimal('14'), Decimal('1609977600'), Decimal('18')),
 (datetime.date(2021, 1, 6), None, Decimal('1609891200'), Decimal('1609718400'), Decimal('14'), Decimal('1609977600'), Decimal('18')),
 (datetime.date(2021, 1, 7), 18, Decimal('1609977600'), Decimal('1609718400'), Decimal('14'), Decimal('1610064000'), Decimal('15')),
 (datetime.date(2021, 1, 8), 15, Decimal('1610064000'), Decimal('1609977600'), Decimal('18'), None, None)]

In [34]:
%%sql
-- there is not index 0
select n[1] from (
select ARRAY[1,2,3,4,5,6,7,8,9,10]
) as t(n)

*  postgresql://luis:***@localhost:5432/postgres
1 rows affected.

[(1,)]

In [36]:
%%sql
WITH temperatures_with_next_and_previous AS (
  SELECT 
    *,

    -- Last known temperature
    (
      SELECT ARRAY[EXTRACT('epoch' FROM t), c]
      FROM temperatures_05 t_inner
      WHERE t_outer.t > t_inner.t
      AND t_inner.c IS NOT NULL
      ORDER BY t_inner.t DESC
      LIMIT 1
    ) AS last_known_temperature,

    -- Next known temperature
    (
      SELECT ARRAY[EXTRACT('epoch' FROM t), c]
      FROM temperatures_05 t_inner
      WHERE t_outer.t < t_inner.t
      AND t_inner.c IS NOT NULL
      ORDER BY t_inner.t ASC
      LIMIT 1
    ) AS next_known_temperature

  FROM
    temperatures_05 as t_outer
),

temperatures_prep AS (
  SELECT
    t,
    c,
    extract('epoch' from t) as x,
    last_known_temperature[1] as x0,
    last_known_temperature[2] as y0,
    next_known_temperature[1] as x1,
    next_known_temperature[2] as y1
  FROM
    temperatures_with_next_and_previous
)

SELECT 
  t,
  c,
  COALESCE(
    c,
    y0 + (x - x0) * ((y1 - y0) / (x1 - x0))
  ) as c_interpolated
FROM 
  temperatures_prep;

*  postgresql://luis:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2021, 1, 1), 10, Decimal('10')),
 (datetime.date(2021, 1, 2), 12, Decimal('12')),
 (datetime.date(2021, 1, 3), None, Decimal('12.999999999999999999993600')),
 (datetime.date(2021, 1, 4), 14, Decimal('14')),
 (datetime.date(2021, 1, 5), None, Decimal('15.333333333333333333296000')),
 (datetime.date(2021, 1, 6), None, Decimal('16.666666666666666666592000')),
 (datetime.date(2021, 1, 7), 18, Decimal('18')),
 (datetime.date(2021, 1, 8), 15, Decimal('15'))]